Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.Secondaries Property
 A list of secondary identifiers of a connection or a seam.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Identifier> Secondaries { get; }
Public ReadOnly Property Secondaries As List(Of Identifier)
	Get
Property Value
Type: List<Identifier>
See Also
Reference
ConnectionBase Class
Tekla.Structures.Plugins Namespace